web/html/emacs_devanagari.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Writing in हिन्दी</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="27 May 2011"/>
<meta name="author" content="aldrin j d'souza"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Writing in हिन्दी</h1>

<p>I'm losing touch of the language I love the most: Hindi. Not the Hindi I converse in but the Hindi I
used to read and write. I have hardly read any of it in the past few years and I haven't written any
of it in ages. All I write these days is on a computer and is invariably in English. The days of me,
writing by hand, are gone for good and the only chance of me staying in touch with my mother-tongue
in its written form, is to start writing in it, on the computer. This note is about how I do that in
emacs.
</p>
<p>
There are tons of other ways do this (which do not involve emacs) but most of them do not interest
me (<i>because</i> they do not involve emacs.) Emacs comes with built in support for input, display and
storage of non-English character sets. For Devanagari, in particular, it supports multiple input
methods. You can choose to type using a proper Hindi key-map (the kind used by the typists one meets
in Gandhi Hall Indore, who, for a surprisingly low fee, will gladly type a शपथ-पत्र for you stating
that you landed on the moon before the Americans did.) Or, you can use a transliteration scheme,
like <a href="http://www.aczoom.com/itrans/#itransencoding">ITRANS</a>.
</p>
<p>
All I need in my <a href="https://github.com/aldrin/ajd/blob/master/dotfiles/.emacs">.emacs</a> is:
</p>



<pre class="src src-elisp">(setq default-input-method <span style="color: #ffaf87;">"devanagari-itrans"</span>)
(add-to-list 'auto-coding-alist '(<span style="color: #ffaf87;">"\\.org"</span> . utf-8))
</pre>




<p>
The first chooses an input method and the second ensures that all of my writing (which is mostly in
<a href="http://orgmode.org">org</a> files) gets encoded as <code>utf-8</code>. Neither of these settings is required, they only serve as
default answers to questions that emacs pops up when I use something outside of English. Now, I can
toggle between languages by a single keystroke (<code>C-\</code>). So, I can start a sentence in English and बीच मे jump into हिन्दी anytime I  feel like. 
</p>
<p>
And that's about it, but before I end, I must dazzle you with a display of my transliteration
skills. For that, I have chosen to key in <a href="http://google.saregama.com/music/pages/listen_popup?mode=listen_popup&amp;query=INH100476260">the song</a> that started it all today. The reason why I wrote
this note. Here it goes:
</p>



<pre class="example">अवधूता, युगन युगन हम योगी...
आवैना जाय, मिटैना कबहूं, सबद अनाहत भोगी 

सब ही ठौर जमात हमरी, सब ही ठौर पर मेला
हम सब माय, सब हैं हम माय, हम है बहुरी अकेला 

हम ही सिद्ध, समाधि हम ही, हम मौनी हम बोले
रूप सरूप अरूप दिखाके, हम ही में हम तो खेलें 

कहे कबीरा जो, सुनो भाई साधो, नाही-न-कोई इच्छा
अपनी मढ़ी में आप मैं डोलूं, खेलू सहज स्वइच्छा ।
</pre>



<p>
This song, more than any other, fills me with a peaceful solitude.  I do not know for sure, if it is
the words of Kabir or the music of the inimitable Kumar Gandharva that does it, but whatever does,
overwhelms me. Finally, for whatever it is worth, I must recommend Kumar Gandharva to
everyone. Listen to whatever you can <a href="http://www.youtube.com/results?search_query=kumar+gandharva">get of him</a>, the man was a genius. पूर्ण विराम।
</p></div>

<div id="postamble">
<p class="date">Date: 27 May 2011</p>
<p class="author">Author: aldrin j d'souza</p>
<p class="creator">Org version 7.7 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
